Repository: Jofreylin/PORTFOLIO_FORECAST
Catalog: public/locale/messages.*.xlf
Languages: es_es

source: To calculate the Compound Annual Growth Rate (CAGR) of a stock share price, you can use the following formula:
es_es: Para calcular la tasa de crecimiento anual compuesta (CAGR) del precio de una acción, puede utilizar la siguiente fórmula:

source: Suppose you want to calculate the CAGR of a stock share price that was $100 five years ago and is $180 today.
es_es: Supongamos que desea calcular la CAGR del precio de una acción que era de $100 hace cinco años y es de $180 hoy.

source: So, the stock's share price grew at a compound annual growth rate of approximately 12.47% over the five-year period.
es_es: Así, el precio de las acciones creció a una tasa de crecimiento anual compuesta de aproximadamente 12,47% durante el período de cinco años.

source: After {{forecastLastRow.year}} year(s)
es_es: Después de {{forecastLastRow.year}} años(s)

source: Total Investment
es_es: Inversión total

source: Portfolio Value
es_es: Valor de la cartera

source: Dividend Income
es_es: Los ingresos por dividendos

source: Reinvested Dividends
es_es: Dividendos reinvertidos

source: Total value added to Portfolio
es_es: Valor total añadido a la cartera

source: Annual Dividend Per Share
es_es: Dividendo anual por acción

source: Frequency Income Dividend
es_es: Frecuencia Ingresos Dividendos

source: New Shares per Period
es_es: Nuevas acciones por período

source: Monthly New Shares
es_es: Nuevas acciones mensuales

source: New Shares from Contributions
es_es: Nuevas acciones provenientes de aportaciones

source: After DRIP
es_es: Después del DRIP

source: Year-End New Balance
es_es: New Balance de fin de año

source: Year-End New Balance After Taxes
es_es: Balance de fin de año después de impuestos

source: Year
es_es: Año

source: Shares Owned
es_es: Acciones en propiedad

source: Dividend Yield
es_es: Rentabilidad por dividendo

source: Annual Dividend Income
es_es: Ingresos por dividendos anuales

source: Distribution Frequency
es_es: Frecuencia de distribución

source: Year-End Shares Owned
es_es: Acciones poseídas al final del año

source: Year-End Stock Price
es_es: Precio de las acciones al final del año

source: Year-End Invested
es_es: Inversión de fin de año

source: Year-End Return
es_es: Declaración de fin de año

source: Year value.year
es_es: Año value.year
